### NULL VALUES HANDLING - NUMERICAL

In [8]:
import pandas as pd
import numpy as np
from sklearn.impute import SimpleImputer

In [2]:
data = pd.read_csv("Data.csv")

In [4]:
data

   Country   Age   Salary Purchased
0   France  44.0  72000.0       Yes
1    Spain  27.0  48000.0       Yes
2      NaN  30.0  54000.0       NaN
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

## 1. DELETING ROWS

##### using dropna() delete all the rows having null value

In [5]:
data.dropna()

   Country   Age   Salary Purchased
0   France  44.0  72000.0       Yes
1    Spain  27.0  48000.0       Yes
3    Spain  38.0  61000.0        No
5   France  35.0  58000.0       Yes
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

## 2. IMPUTERS

fill in the missing value strategy for null values

In [9]:
imputer = SimpleImputer(missing_values=np.nan,strategy='mean')

data.iloc[:, 1:3]: This part of the code selects a subset of the dataframe data. Specifically, it selects all rows (:) and the columns from index 1 up to but not including index 3.

.values: This converts the selected columns into a NumPy array. This is often necessary because many machine learning models and preprocessing tools work with NumPy arrays rather than pandas dataframes.

In [15]:
imputer.fit(data.iloc[:,1 : 3].values)

data.iloc[:,1 : 3] = imputer.transform(data.iloc[:,1 : 3].values)

Fitting the Imputer:

imputer.fit(...): Here, the fit method of the imputer object is called with the selected data. The imputer is an instance of a class from a library such as scikit-learn, which is used to fill in missing values.
During the fitting process, the imputer learns the parameters needed to replace missing values. For example, if you're using a SimpleImputer with the strategy set to "mean", it will calculate the mean of each column and store it for later use.

Transforming Data:
imputer.transform(...): This method uses the parameters learned during the fit step to transform the data. It replaces the missing values in the data with the learned values (e.g., mean, median, most frequent value).

In [16]:
data

   Country        Age        Salary Purchased
0   France  44.000000  72000.000000       Yes
1    Spain  27.000000  48000.000000       Yes
2      NaN  30.000000  54000.000000       NaN
3    Spain  38.000000  61000.000000        No
4  Germany  40.000000  63777.777778       Yes
5   France  35.000000  58000.000000       Yes
6    Spain  38.777778  52000.000000        No
7   France  48.000000  79000.000000       Yes
8  Germany  50.000000  83000.000000        No
9   France  37.000000  67000.000000       Yes